With this configuration

```hcl
provider "aws" {}

resource "aws_appmesh_mesh" "test" {
  name = "ewbankkit-test"
}

resource "aws_appmesh_virtual_router" "test" {
  name      = "ewbankkit-test"
  mesh_name = aws_appmesh_mesh.test.id

  spec {
    listener {
      port_mapping {
        port     = 8080
        protocol = "grpc"
      }
    }
  }
}

resource "aws_appmesh_virtual_node" "test" {
  name      = "ewbankkit-test"
  mesh_name = aws_appmesh_mesh.test.id

  spec {
    listener {
      port_mapping {
        port     = 8080
        protocol = "grpc"
      }
    }

    service_discovery {
      dns {
        hostname = "test1.simpleapp.local"
      }
    }
  }
}

resource "aws_appmesh_route" "test" {
  name                = "ewbankkit-test"
  mesh_name           = aws_appmesh_mesh.test.id
  virtual_router_name = aws_appmesh_virtual_router.test.name

  spec {
    grpc_route {
      match {}

      action {
        weighted_target {
          virtual_node = aws_appmesh_virtual_node.test.name
          weight       = 100
        }
      }
    }
  }
}
```

Run `terraform apply`, then

```console
% terraform plan
aws_appmesh_mesh.test: Refreshing state... [id=ewbankkit-test]
aws_appmesh_virtual_router.test: Refreshing state... [id=cc20c272-7781-48f4-9afa-5071cd10a16c]
aws_appmesh_virtual_node.test: Refreshing state... [id=899a37e7-1a16-473d-a32e-76cad32add62]
aws_appmesh_route.test: Refreshing state... [id=f9118122-592e-49fa-af24-9d38b4c7e92a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_appmesh_mesh.test has been changed
  ~ resource "aws_appmesh_mesh" "test" {
        id                = "ewbankkit-test"
        name              = "ewbankkit-test"
      + tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_appmesh_route.test has been changed
  ~ resource "aws_appmesh_route" "test" {
        id                  = "f9118122-592e-49fa-af24-9d38b4c7e92a"
        name                = "ewbankkit-test"
      + tags                = {}
        # (8 unchanged attributes hidden)

      ~ spec {
            # (1 unchanged attribute hidden)

          ~ grpc_route {
              ~ action {
                  + weighted_target {
                      + port         = 0
                      + virtual_node = "ewbankkit-test"
                      + weight       = 100
                    }
                  - weighted_target {
                      - virtual_node = "ewbankkit-test" -> null
                      - weight       = 100 -> null
                    }
                }

                # (1 unchanged block hidden)
            }
        }
    }
  # aws_appmesh_virtual_node.test has been changed
  ~ resource "aws_appmesh_virtual_node" "test" {
        id                = "899a37e7-1a16-473d-a32e-76cad32add62"
        name              = "ewbankkit-test"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_appmesh_virtual_router.test has been changed
  ~ resource "aws_appmesh_virtual_router" "test" {
        id                = "cc20c272-7781-48f4-9afa-5071cd10a16c"
        name              = "ewbankkit-test"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

No changes. Your infrastructure matches the configuration.

Your configuration already matches the changes detected above. If you'd like to update the Terraform state to match, create and apply a refresh-only
plan:
  terraform apply -refresh-only
```

Remove `aws_appmesh_route.test` from state, then

```console
% terraform plan
aws_appmesh_mesh.test: Refreshing state... [id=ewbankkit-test]
aws_appmesh_virtual_router.test: Refreshing state... [id=cc20c272-7781-48f4-9afa-5071cd10a16c]
aws_appmesh_virtual_node.test: Refreshing state... [id=899a37e7-1a16-473d-a32e-76cad32add62]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_appmesh_virtual_node.test has been changed
  ~ resource "aws_appmesh_virtual_node" "test" {
        id                = "899a37e7-1a16-473d-a32e-76cad32add62"
        name              = "ewbankkit-test"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_appmesh_virtual_router.test has been changed
  ~ resource "aws_appmesh_virtual_router" "test" {
        id                = "cc20c272-7781-48f4-9afa-5071cd10a16c"
        name              = "ewbankkit-test"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_appmesh_mesh.test has been changed
  ~ resource "aws_appmesh_mesh" "test" {
        id                = "ewbankkit-test"
        name              = "ewbankkit-test"
      + tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_appmesh_route.test will be created
  + resource "aws_appmesh_route" "test" {
      + arn                 = (known after apply)
      + created_date        = (known after apply)
      + id                  = (known after apply)
      + last_updated_date   = (known after apply)
      + mesh_name           = "ewbankkit-test"
      + mesh_owner          = (known after apply)
      + name                = "ewbankkit-test"
      + resource_owner      = (known after apply)
      + tags_all            = (known after apply)
      + virtual_router_name = "ewbankkit-test"

      + spec {
          + grpc_route {
              + action {
                  + weighted_target {
                      + virtual_node = "ewbankkit-test"
                      + weight       = 100
                    }
                }

              + match {
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

Import `aws_appmesh_route.test`

```console
% terraform import aws_appmesh_route.test ewbankkit-test/ewbankkit-test/ewbankkit-test
aws_appmesh_route.test: Importing from ID "ewbankkit-test/ewbankkit-test/ewbankkit-test"...
aws_appmesh_route.test: Import prepared!
  Prepared aws_appmesh_route for import
aws_appmesh_route.test: Refreshing state... [id=f9118122-592e-49fa-af24-9d38b4c7e92a]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
```

then

```console
% terraform plan
aws_appmesh_mesh.test: Refreshing state... [id=ewbankkit-test]
aws_appmesh_virtual_router.test: Refreshing state... [id=cc20c272-7781-48f4-9afa-5071cd10a16c]
aws_appmesh_virtual_node.test: Refreshing state... [id=899a37e7-1a16-473d-a32e-76cad32add62]
aws_appmesh_route.test: Refreshing state... [id=f9118122-592e-49fa-af24-9d38b4c7e92a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # aws_appmesh_virtual_node.test has been changed
  ~ resource "aws_appmesh_virtual_node" "test" {
        id                = "899a37e7-1a16-473d-a32e-76cad32add62"
        name              = "ewbankkit-test"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_appmesh_virtual_router.test has been changed
  ~ resource "aws_appmesh_virtual_router" "test" {
        id                = "cc20c272-7781-48f4-9afa-5071cd10a16c"
        name              = "ewbankkit-test"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_appmesh_mesh.test has been changed
  ~ resource "aws_appmesh_mesh" "test" {
        id                = "ewbankkit-test"
        name              = "ewbankkit-test"
      + tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

No changes. Your infrastructure matches the configuration.

Your configuration already matches the changes detected above. If you'd like to update the Terraform state to match, create and apply a refresh-only
plan:
  terraform apply -refresh-only
```